In [1]:
# filter missing data from a Series
from numpy import nan as NA

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [5]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
# on a DataFrame, dropna by default drops any row that contains an NA value
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [8]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [10]:
# only drop rows that are ALL NA - use how='all'
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
# remember axis=1 means work on columns
data[4] = NA

In [12]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
# keep only rows that have a certain number of observations
df = pd.DataFrame(np.random.randn(7, 3))

In [15]:
df

          0         1         2
0  1.186319 -0.253117  0.201715
1 -1.404263 -1.541116 -1.796673
2 -1.012627  0.078289  0.332672
3  0.744300 -0.301756  2.160449
4  0.571434  1.509906 -1.100631
5 -0.232696  0.617013  0.976366
6 -0.441061 -0.067052 -0.275846

In [16]:
# first 4 rows of column 1 are missing
df.iloc[:4, 1] = NA

In [17]:
# first 2 rows of column 2 are missing
df.iloc[:2, 2] = NA

In [18]:
df

          0         1         2
0  1.186319       NaN       NaN
1 -1.404263       NaN       NaN
2 -1.012627       NaN  0.332672
3  0.744300       NaN  2.160449
4  0.571434  1.509906 -1.100631
5 -0.232696  0.617013  0.976366
6 -0.441061 -0.067052 -0.275846

In [19]:
# keep rows with 2 or more observations
df.dropna(thresh=2)

          0         1         2
2 -1.012627       NaN  0.332672
3  0.744300       NaN  2.160449
4  0.571434  1.509906 -1.100631
5 -0.232696  0.617013  0.976366
6 -0.441061 -0.067052 -0.275846

In [20]:
# without thresh setting
df.dropna()

          0         1         2
4  0.571434  1.509906 -1.100631
5 -0.232696  0.617013  0.976366
6 -0.441061 -0.067052 -0.275846

In [21]:
# use fillna to fill in missing data
# a constant uses that value to replace
df.fillna(0)

          0         1         2
0  1.186319  0.000000  0.000000
1 -1.404263  0.000000  0.000000
2 -1.012627  0.000000  0.332672
3  0.744300  0.000000  2.160449
4  0.571434  1.509906 -1.100631
5 -0.232696  0.617013  0.976366
6 -0.441061 -0.067052 -0.275846

In [22]:
# pass in a dict to have a different value for each column
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.186319  0.500000  0.000000
1 -1.404263  0.500000  0.000000
2 -1.012627  0.500000  0.332672
3  0.744300  0.500000  2.160449
4  0.571434  1.509906 -1.100631
5 -0.232696  0.617013  0.976366
6 -0.441061 -0.067052 -0.275846

In [23]:
# fillna returns a new object
# you can modify in place
_ = df.fillna(0, inplace=True)

In [24]:
df

          0         1         2
0  1.186319  0.000000  0.000000
1 -1.404263  0.000000  0.000000
2 -1.012627  0.000000  0.332672
3  0.744300  0.000000  2.160449
4  0.571434  1.509906 -1.100631
5 -0.232696  0.617013  0.976366
6 -0.441061 -0.067052 -0.275846

In [25]:
# you can use interpolation methods to fill. 'ffill' is forward fill
df = pd.DataFrame(np.random.randn(6, 3))

In [26]:
df.iloc[2:, 1] = NA

In [27]:
df.iloc[4:, 2] = NA

In [28]:
df

          0         1         2
0  0.556786  2.269347  0.934676
1 -0.257714  1.518515  0.988869
2 -1.621396       NaN -1.199707
3 -0.977479       NaN -0.515133
4  0.529595       NaN       NaN
5 -0.575157       NaN       NaN

In [29]:
df.fillna(method='ffill')

          0         1         2
0  0.556786  2.269347  0.934676
1 -0.257714  1.518515  0.988869
2 -1.621396  1.518515 -1.199707
3 -0.977479  1.518515 -0.515133
4  0.529595  1.518515 -0.515133
5 -0.575157  1.518515 -0.515133

In [30]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.556786  2.269347  0.934676
1 -0.257714  1.518515  0.988869
2 -1.621396  1.518515 -1.199707
3 -0.977479  1.518515 -0.515133
4  0.529595       NaN -0.515133
5 -0.575157       NaN -0.515133

In [31]:
# you can fill with the mean value for a series
data = pd.Series([1., NA, 3.5, NA, 7])

In [32]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [33]:
# working with duplicate data
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [34]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [35]:
# duplicated() checks if a row has been seen in a previous row
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
# drop_duplicates() removes the duplicated rows
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
data['v1'] = range(7)

In [41]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [42]:
# duplicated and drop_duplicates can take a list of columns to include
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [44]:
# duplicated and drop_duplicates take the first observation
# use keep='last' to take the last observation
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [45]:
# transforming data using a function or mapping
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [46]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [47]:
# let's add a column that shows which animal each food came from
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [48]:
# need to convert the foods to lowercase
lowercased = data['food'].str.lower()

In [49]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [50]:
data['animal'] = lowercased.map(meat_to_animal)

In [51]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [53]:
# or use a function and map()
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [54]:
# replacing values
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [55]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [57]:
# can replace multiple values
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [58]:
# can also replace with a list of substitutes
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
# replace arg can also be a dict
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [60]:
# renaming axis indexes
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [61]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [62]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [63]:
transform = lambda x: x[:4].upper()

In [64]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [66]:
data.index = data.index.map(transform)

In [67]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [70]:
# rename the row and column names - does not change the original
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [71]:
# rename with dicts to replace a subset of labels
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [72]:
# you can modify inplace
data.rename(index={'OHIO': 'MAINE'}, inplace=True)

In [73]:
data

       one  two  three  four
MAINE    0    1      2     3
COLO     4    5      6     7
NEW      8    9     10    11

In [74]:
# Categorize and binning (bins)
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [75]:
# split the data into bins
# 4 bins needs 5 edges
# bins are 18-25, 26-35, 36-60, 61-100
bins = [18, 25, 35, 60, 100]

In [77]:
cats = pd.cut(ages, bins)

In [78]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [79]:
# instead of a list of edges, you can specify the number of bins you want
cats2 = pd.cut(ages, 4)

In [80]:
# the bin edges here are evenly spaced between the lowest and highest values in the data set
cats2

[(19.959, 30.25], (19.959, 30.25], (19.959, 30.25], (19.959, 30.25], (19.959, 30.25], ..., (30.25, 40.5], (50.75, 61.0], (40.5, 50.75], (40.5, 50.75], (30.25, 40.5]]
Length: 12
Categories (4, interval[float64]): [(19.959, 30.25] < (30.25, 40.5] < (40.5, 50.75] < (50.75, 61.0]]

In [81]:
# internally cats is a Category object
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [82]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [83]:
# how many age items are in each bin?
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [84]:
# for the intervals, you can change which end is closed (inclusive, shows as bracket)
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [85]:
# you can label the bins
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [86]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [90]:
# with cut, you probably wont get the same number of items in each bin
# if that is what you want, use qcut
data = np.random.randn(1000)  # Normally distributed

In [91]:
cats = pd.qcut(data, 4)   # cut into quartiles

In [92]:
cats

[(-0.624, 0.0496], (0.0496, 0.626], (-3.05, -0.624], (-3.05, -0.624], (0.0496, 0.626], ..., (0.626, 3.728], (0.626, 3.728], (-3.05, -0.624], (0.626, 3.728], (-0.624, 0.0496]]
Length: 1000
Categories (4, interval[float64]): [(-3.05, -0.624] < (-0.624, 0.0496] < (0.0496, 0.626] < (0.626, 3.728]]

In [93]:
pd.value_counts(cats)

(0.626, 3.728]      250
(0.0496, 0.626]     250
(-0.624, 0.0496]    250
(-3.05, -0.624]     250
dtype: int64

In [94]:
# detecting and filtering outliers
data = pd.DataFrame(np.random.randn(1000, 4))

In [95]:
data.head()

          0         1         2         3
0  2.175499  0.433767 -0.213164 -0.257838
1 -0.721648  1.079403  0.824481  0.639443
2  0.844119  0.232522 -0.184323 -0.049182
3  1.035086  1.668509 -0.994537  1.339452
4 -0.666491  0.133103  0.741279  0.012837

In [97]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013900    -0.052211    -0.012363    -0.015059
std       1.000930     1.003545     0.997950     1.016265
min      -3.742932    -3.713031    -2.631872    -3.818369
25%      -0.695483    -0.741211    -0.722168    -0.689468
50%       0.005070    -0.056947    -0.005059    -0.022730
75%       0.689833     0.592372     0.696446     0.664237
max       3.270640     3.018967     3.030129     3.159637

In [98]:
# find values in one of the columns exceeding 3 in abs value
col = data[2]

In [99]:
col[np.abs(col) > 3]

744    3.030129
Name: 2, dtype: float64

In [100]:
# to select all rows containing a value exceed abs(3) use any()
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
85   3.270640 -1.642011 -0.598981 -0.166921
104  0.605421  0.215089 -0.197512 -3.418559
194 -1.651187 -0.711042  1.086632  3.103856
229 -0.217498 -0.209531  0.629923 -3.818369
327 -0.038437  0.522066  2.975528 -3.159946
341 -0.372748 -0.358913  0.131041  3.088280
492 -3.742932  0.519546  1.512151 -0.359341
542 -1.258549 -3.122993 -0.313458  1.152807
603 -0.365612 -3.142988 -0.186367  0.365147
724 -3.313610  0.790565  1.195854 -1.028156
744 -2.207766  0.280000  3.030129 -1.330710
782  0.574016  3.018967  0.519979 -0.171323
873 -0.562843 -0.025042 -1.364648  3.159637
899 -0.586078 -3.713031 -1.513047 -0.153350

In [103]:
# cap values outside the -3 to 3 interval
# np.sign() produces 1 and -1 values depending if the data is positive or negative
data[np.abs(data) > 3] = np.sign(data) * 3

In [104]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.014686    -0.051251    -0.012393    -0.014014
std       0.996565     1.000331     0.997859     1.010647
min      -3.000000    -3.000000    -2.631872    -3.000000
25%      -0.695483    -0.741211    -0.722168    -0.689468
50%       0.005070    -0.056947    -0.005059    -0.022730
75%       0.689833     0.592372     0.696446     0.664237
max       3.000000     3.000000     3.000000     3.000000

In [105]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1 -1.0  1.0  1.0  1.0
2  1.0  1.0 -1.0 -1.0
3  1.0  1.0 -1.0  1.0
4 -1.0  1.0  1.0  1.0

In [106]:
# Permutation and random sampling
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [107]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [108]:
# get row numbers 0-4 in a random order
sampler = np.random.permutation(5)

In [109]:
sampler

array([2, 3, 1, 4, 0])

In [110]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3

In [111]:
# select a random subset without replacement
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19

In [112]:
# to generate a sample with replacement (to allow repeat choices) pass replace=True
choices = pd.Series([5, 7, -1, 6, 4])

In [113]:
draws = choices.sample(n=10, replace=True)

In [114]:
draws

3    6
2   -1
4    4
4    4
4    4
0    5
4    4
0    5
2   -1
2   -1
dtype: int64

In [115]:
# computing indicator or dummy variables
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [116]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [118]:
# generate an indicator matrix
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [119]:
# you can prefix the column names
dummies = pd.get_dummies(df['key'], prefix='key')

In [120]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [121]:
# and merge it
df_with_dummy = df[['data1']].join(dummies)

In [122]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [123]:
# dealing with multiple categories
mnames = ['movie_id', 'title', 'genres']

In [125]:
movies = pd.read_table('datasets/movies.dat', sep='::',
                       header=None, names=mnames, engine='python')

In [126]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [127]:
# first get the list of unique genres
all_genres = []

In [128]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [131]:
genres = pd.unique(all_genres)

In [132]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [134]:
# start with a data frame of all zeroes
zero_matrix = np.zeros((len(movies), len(genres)))

In [135]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [136]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [137]:
# use dummies.columns to compute the column indices for each genre
# try with first movie
gen = movies.genres[0]

In [139]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [140]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [141]:
# use .iloc to set values based on these indices
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [142]:
# combine it with movies
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [143]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [144]:
# a useful recipe is to combine get_dummies with cut
np.random.seed(12345)

In [145]:
values = np.random.rand(10)

In [146]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [147]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [148]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [149]:
# string functions in pandas
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [150]:
data = pd.Series(data)

In [151]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [152]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [153]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [156]:
# a regular expression to take apart emails
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [157]:
import re

In [158]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [159]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]

In [160]:
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [161]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [162]:
# you can slice strings
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [164]:
# the extract method will return the captured groups of a regex into a data frame
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN